IDEA StatiCa Open Model
BeamData.CrossSectionType Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Type of cross section
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public string CrossSectionType { get; set; }
Public Property CrossSectionType As String
	Get
	Set
public:
property String^ CrossSectionType {
	String^ get ();
	void set (String^ value);
}
Property Value
Type: String
See Also
Reference
BeamData Class
IdeaRS.OpenModel.Connection Namespace